-- MySQL dump 10.13  Distrib 5.7.17, for Win64 (x86_64)
--
-- Host: localhost    Database: tmall_ssm
-- ------------------------------------------------------
-- Server version	5.7.21-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `property`
--

DROP TABLE IF EXISTS `property`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `property` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `cid` int(11) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `fk_property_category` (`cid`),
  CONSTRAINT `fk_property_category` FOREIGN KEY (`cid`) REFERENCES `category` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=258 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `property`
--

LOCK TABLES `property` WRITE;
/*!40000 ALTER TABLE `property` DISABLE KEYS */;
INSERT INTO `property` VALUES (1,83,'品牌'),(2,83,'证书状态'),(3,83,'3C产品型号'),(4,83,'申请人名称'),(5,83,'证书编号'),(6,83,'分辨率'),(7,83,'型号'),(8,83,'制造商名称'),(9,83,'网络连接方式'),(10,83,'产品名称'),(11,83,'能效等级'),(12,83,'3D类型'),(13,83,'操作系统'),(14,82,'品牌'),(15,82,'冲水按键类型'),(16,82,'坐便器类型'),(17,82,'盖板是否缓冲'),(18,82,'型号'),(19,82,'坐便器冲水方式'),(20,82,'排水方式'),(21,82,'材质'),(22,82,'最小坑距'),(23,82,'承重'),(24,82,'颜色分类'),(25,82,'坐便冲水量'),(26,82,'同城服务'),(27,81,'风格'),(28,81,'城市'),(29,81,'面料饰面工艺'),(30,81,'是否带储物空间'),(31,81,'包装体积'),(32,81,'颜色分类'),(33,81,'附加功能'),(34,81,'是否可拆洗'),(35,81,'结构工艺'),(36,81,'设计元素'),(37,81,'几人坐'),(38,81,'图案'),(39,81,'是否组装'),(40,81,'面料'),(41,81,'可送货/安装'),(42,81,'木质结构工艺'),(43,81,'沙发组合形式'),(44,81,'产地'),(45,81,'是否可定制'),(46,81,'品牌'),(47,81,'适用对象'),(48,81,'材质'),(49,81,'款式定位'),(50,81,'填充物'),(51,81,'填充物硬度'),(52,81,'出租车是否可运输'),(53,81,'型号'),(54,81,'木质材质'),(55,81,'是否可预售'),(56,81,'安装说明详情'),(57,80,'品牌'),(58,80,'证书状态'),(59,80,'3C产品型号'),(60,80,'申请人名称'),(61,80,'证书编号'),(62,80,'型号'),(63,80,'控制方式'),(64,80,'制造商名称'),(65,80,'款式'),(66,80,'产品名称'),(67,80,'能效等级'),(68,79,'上市时间'),(69,79,'款式'),(70,79,'是否商场同款'),(71,79,'货号'),(72,79,'品牌'),(73,78,'液晶显示'),(74,78,'尘盒容量'),(75,78,'外观造型'),(76,78,'功能'),(77,78,'最高高度'),(78,78,'碰撞保护'),(79,78,'是否自动充电'),(80,78,'电池容量'),(81,78,'有无虚拟墙'),(82,78,'是否有定时预约功能'),(83,78,'货号'),(84,78,'颜色分类'),(85,78,'清扫路线'),(86,78,'是否带遥控器'),(87,77,'品牌'),(88,77,'转速'),(89,77,'证书状态'),(90,77,'3C产品型号'),(91,77,'申请人名称'),(92,77,'额定功率'),(93,77,'证书编号'),(94,77,'型号'),(95,77,'制造商名称'),(96,77,'附加功能'),(97,77,'采购地'),(98,77,'机身材质'),(99,77,'颜色分类'),(100,77,'产品名称'),(101,77,'操作方式'),(102,76,'冰箱冷柜机型'),(103,76,'证书状态'),(104,76,'箱门结构'),(105,76,'美菱冰箱型号'),(106,76,'3C产品型号'),(107,76,'申请人名称'),(108,76,'证书编号'),(109,76,'制造商名称'),(110,76,'制冷方式'),(111,76,'产品名称'),(112,76,'能效等级'),(113,75,'空调类型'),(114,75,'证书状态'),(115,75,'证书编号'),(116,75,'海信空调型号'),(117,75,'工作方式'),(118,75,'冷暖类型'),(119,75,'产品名称'),(120,75,'能效等级'),(121,75,'空调功率'),(122,75,'适用面积'),(123,74,'风格'),(124,74,'颜色分类'),(125,74,'显示方式'),(126,74,'表壳材质'),(127,74,'机芯类型'),(128,74,'手表镜面材质'),(129,74,'机芯产地'),(130,74,'表盘厚度'),(131,74,'品牌产地'),(132,74,'成色'),(133,74,'表盘直径'),(134,74,'上市时间'),(135,74,'表带材质'),(136,74,'保修'),(137,74,'品牌'),(138,74,'形状'),(139,74,'防水深度'),(140,74,'流行元素'),(141,74,'手表种类'),(142,74,'型号'),(143,73,'风格'),(144,73,'颜色分类'),(145,73,'显示方式'),(146,73,'表壳材质'),(147,73,'机芯类型'),(148,73,'手表镜面材质'),(149,73,'表扣款式'),(150,73,'表盘厚度'),(151,73,'品牌产地'),(152,73,'表盘直径'),(153,73,'成色'),(154,73,'上市时间'),(155,73,'表带材质'),(156,73,'保修'),(157,73,'品牌'),(158,73,'形状'),(159,73,'防水深度'),(160,73,'表底类型'),(161,73,'表冠类型'),(162,73,'流行元素'),(163,73,'手表种类'),(164,73,'型号'),(165,72,'风格'),(166,72,'大小'),(167,72,'内部结构'),(168,72,'颜色分类'),(169,72,'箱包硬度'),(170,72,'款式'),(171,72,'图案'),(172,72,'成色'),(173,72,'里料材质'),(174,72,'上市时间'),(175,72,'品牌'),(176,72,'形状'),(177,72,'箱包外袋种类'),(178,72,'适用对象'),(179,72,'质地'),(180,72,'拿包方式'),(181,72,'适用场景'),(182,72,'提拎部件类型'),(183,72,'闭合方式'),(184,72,'是否可折叠'),(185,72,'有无夹层'),(186,72,'货号'),(187,72,'皮革材质'),(188,71,'销售渠道类型'),(189,71,'面料分类'),(190,71,'上市年份季节'),(191,71,'品牌'),(192,71,'货号'),(193,71,'基础风格'),(194,71,'材质成分'),(195,71,'厚薄'),(196,69,'风格'),(197,69,'鞋面材质'),(198,69,'低帮鞋品名'),(199,69,'鞋底材质'),(200,69,'颜色分类'),(201,69,'上市年份季节'),(202,69,'款式'),(203,69,'图案'),(204,69,'鞋面内里材质'),(205,69,'季节'),(206,69,'细分风格'),(207,69,'鞋跟高'),(208,69,'品牌'),(209,69,'适用对象'),(210,69,'销售渠道类型'),(211,69,'功能'),(212,69,'鞋制作工艺'),(213,69,'尺码'),(214,69,'闭合方式'),(215,69,'流行元素'),(216,69,'跟底款式'),(217,69,'货号'),(218,69,'鞋头款式'),(219,69,'鞋垫材质'),(220,69,'场合'),(221,68,'适用年龄'),(222,68,'颜色分类'),(223,68,'上市年份季节'),(224,68,'尺码'),(225,68,'货号'),(226,68,'品牌'),(227,68,'材质成分'),(228,64,'品牌'),(229,64,'产地'),(230,64,'上市时间'),(231,64,'型号'),(232,64,'功能'),(233,64,'适用性别'),(234,64,'风格'),(235,64,'价格区间'),(236,64,'眼镜配件类型'),(237,64,'是否商场同款'),(238,64,'镜片材质'),(239,64,'货号'),(240,64,'颜色分类'),(241,64,'是否可调'),(242,64,'适合脸型'),(243,60,'产地'),(244,60,'证书状态'),(245,60,'3C产品型号'),(246,60,'申请人名称'),(247,60,'安装接口'),(248,60,'适合体重'),(249,60,'证书编号'),(250,60,'型号'),(251,60,'制造商名称'),(252,60,'颜色分类'),(253,60,'款式'),(254,60,'产品名称'),(255,60,'人体固定方式'),(256,60,'安全座椅品牌'),(257,60,'适用年龄');
/*!40000 ALTER TABLE `property` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-05-23 13:35:33
